/*------------------------------------------------------------------------------
MEM_EXTENDED_6.C


------------------------------------------------------------------------------*/

#include "../main.h"



// глобальна€ переменна€
boolean                 boExt6Flag;

// счетчик переходов через сутки и мес€ц
uint                    cwDayCan6, cwMonCan6;

// буфер значений счетчиков на конец 12 мес€цев
value6                  mpCntMonCan6[bCANALS];

// буфер значений счетчиков на начало суток дл€ текущего мес€ца
value6                  mpCntCan6[bCANALS];
