/*------------------------------------------------------------------------------
dff.c


------------------------------------------------------------------------------*/

#include "../../main.h"
#include "dff.h"



uint64_t    DffDecodeLong64(uchar  *pb) {
  uint64_t result = 0;
  int num = 0;
  uint64_t ch;

  do {
    ch = ( * pb & 0x7F); // читаем очередные 7 бит
    result += ch << (num * 7); //добавляем к результату
    num++; // можно num+=7;, тогда вместо (num*7) везде просто num
  }
  while (( * (pb++) & 0x80)); //условие выхода нулевой флаг lbf

  if (ch >> 6) //если последний принятый бит был 1 заполняем старшие разряды единицами
    result |= 0xffffffffffffffff << (num * 7);

  return result;
}
