// максимальная разница времени между сумматором и счетчиками без коррекции: начальное значение для прямой связи
#define bCORRECT_DIRECT   3

// максимальная разница времени между сумматором и счетчиками без коррекции: начальное значение для модемной связи
#define bCORRECT_MODEM    6

// максимальная разница времени между сумматором и счетчиками без коррекции: минимальное значение
#define bCORRECT_MINIMUM  1

// максимальная разница времени между сумматором и счетчиками без коррекции: максимальное значение
#define bCORRECT_MAXIMUM  20

// начальное значение для счетчика СЕ102
#define bCORRECT_DEVICE_S 10

