/*------------------------------------------------------------------------------
MEM_REALTIME.S


------------------------------------------------------------------------------*/

#include        "../main.h"



// переменные для обработки переходов времени
time                    tiCurr, tiPrev;

// индексы по кольцевым буферам
uchar                   ibSoftMnt,
                        ibSoftHou,
                        ibSoftDay, ibHardDay,
                        ibSoftMon, ibHardMon;

// индексы по кольцевому буферу
uint                    iwHardHou;
