/*------------------------------------------------------------------------------
MEM_ESC.C


------------------------------------------------------------------------------*/

#include "../main.h"



// текущее количество виртуальных приборов —Ёћ-1
uchar                   bMaxMachineEsc;

// массив индексов активных логических приборов
uchar                   mpibMachineEsc[bPORTS];

// индекс текущего активного логического прибора
uchar                   ibMachineEsc;

// флаг блокировани€ доступа
boolean                 boBlockingEsc;
