/*------------------------------------------------------------------------------
MEM_EXTENDED_4T.C


------------------------------------------------------------------------------*/

#include        "../main.h"



// буфер значений счетчиков на начало 12 мес€цев (по тарифам)
value6t       _xdata    mpCntMonCan4T[bMONTHS][bCANALS];

// переменна€
value6t       _xdata    v6tBuff;

// глобальна€ переменна€
boolean       _xdata    boExt4TFlag;

// глобальна€ переменна€
uchar         _xdata    bExt4TMonths;
