/*------------------------------------------------------------------------------
MEM_ESC,C


------------------------------------------------------------------------------*/

#include "../main.h"



// максимальное количество логических приборов СЭМ-1
uchar                   bMachinesEsc;

// массив индексов активных логических приборов СЭМ-1
uchar                   mpibActiveEsc[bPORTS];

// индекс активного логического прибора СЭМ-1
uchar                   ibActiveEsc;

// флаг блокирования Esc протокола
bool                    boBlockEsc;
