/*------------------------------------------------------------------------------
MEM_EXTENDED_0,C


------------------------------------------------------------------------------*/

#include "../main.h"



// флаг разрешения режима
bool                    boExt0Flag;

// количество повторов: граничное и максимальное
uchar                   bExt0Limit, bExt0Counter;

// массив повторов
ulong                   mpdwExt0RepeatsPH[bPORTS][48];

// массив ошибок
ulong                   mpdwExt0ErrorsPH[bPORTS][48];
